IDEA Open Model
BeamDataEc2.TypeOfSupportLeft Property
Compatible with IDEA StatiCa 20.1
 Type of support on the left side
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public TypeOfSupportConditions TypeOfSupportLeft { get; set; }
Public Property TypeOfSupportLeft As TypeOfSupportConditions
	Get
	Set
Property Value
Type: TypeOfSupportConditions
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace